# 1. Titanic

## 1-1. 문제 정의 및 가설 수립
* 나이가 어릴수록 생존률이 높을 것이다.
* 여자의 생존률이 남자보다 높을 것이다.
* 높은 객실 등급에 탄 사람들이 낮은 객실 등급보다 생존률이 높을 것이다.

## 1-2. 데이터 가져오기
* kaggle 데이터 (https://www.kaggle.com/datasets)
* 공공데이터 포털 (https://www.data.go.kr/)
* 서울 열린데이터 광장 (https://data.seoul.go.kr/)
* 통계청 (https://kosis.kr/)
* 기상청 (https://data.kma.go.kr/)

In [61]:
#!kaggle competitions download -c titanic

## 1-3. 데이터 로드하기

In [63]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

ModuleNotFoundError: No module named 'matplotlib'

In [64]:
df = pd.read_csv('./titanic/train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [65]:
# 한글 컬럼명 바꾸기
df.columns = ['id', '생존여부', '객실등급', '이름', '성별', '나이', '형제배우자수', '부모자식수', '티켓번호', '요금', '수하물번호', '선착장']
df.head()

,id,생존여부,객실등급,이름,성별,나이,형제배우자수,부모자식수,티켓번호,요금,수하물번호,선착장
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1-4. 데이터 살펴보기

In [66]:
df.shape

(891, 12)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      891 non-null    int64
 1   생존여부    891 non-null    int64
 2   객실등급    891 non-null    int64
 3   이름      891 non-null    object
 4   성별      891 non-null    object
 5   나이      714 non-null    float64
 6   형제배우자수  891 non-null    int64
 7   부모자식수   891 non-null    int64
 8   티켓번호    891 non-null    object
 9   요금      891 non-null    float64
 10  수하물번호   204 non-null    object
 11  선착장     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [68]:
df.describe()

,id,생존여부,객실등급,나이,형제배우자수,부모자식수,요금
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [69]:
df.isnull().sum()

id          0
생존여부        0
객실등급        0
이름          0
성별          0
나이        177
형제배우자수      0
부모자식수       0
티켓번호        0
요금          0
수하물번호     687
선착장         2
dtype: int64

In [70]:
df.객실등급.value_counts()

3    491
1    216
2    184
Name: 객실등급, dtype: int64

In [71]:
df.선착장.value_counts()

S    644
C    168
Q     77
Name: 선착장, dtype: int64

In [72]:
# 불필요한 컬럼 삭제하기
# id, 이름, 티켓번호, 수하물번호
df.drop(['id', '이름', '티켓번호', '수하물번호'], axis=1, inplace=True)
df.head()

   생존여부  객실등급      성별    나이  형제배우자수  부모자식수       요금 선착장
0     0     3    male  22.0       1      0   7.2500   S
1     1     1  female  38.0       1      0  71.2833   C
2     1     3  female  26.0       0      0   7.9250   S
3     1     1  female  35.0       1      0  53.1000   S
4     0     3    male  35.0       0      0   8.0500   S

## 1-5, EDA (탐색적 데이터 분석)

### 1. 생존자수 보기

In [73]:
df.생존여부.value_counts()

0    549
1    342
Name: 생존여부, dtype: int64

In [74]:
# Count Plot
sns.countPlot(x='생존여부', data=df)
plt.show()

NameError: name 'sns' is not defined

In [75]:
# Pie Chart
plt.pie(df.생존여부.value_counts())

NameError: name 'plt' is not defined